---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorShape(System.Int32)
source: html/c5054b58-4830-46b1-4337-801e5ca19054.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConnectorShape Method

Gets the fabrication connector shape from its identifier.

## Syntax (C#)
```csharp
public ConnectorProfileType GetFabricationConnectorShape(
	int fabricationConnectorId
)
```

## Parameters
- **fabricationConnectorId** (`System.Int32`) - The fabrication connector identifier.

## Returns
The fabrication connector's shape.